In [ ]:
# EDA on Sales Data

In [1]:
import pandas as pd
import numpy as np
from IPython.display import display
pd.options.display.float_format = '{:,.2f}'.format
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
df = pd.read_csv("sale_data.csv")

In [3]:
df

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
0,Middle East and North Africa,Libya,Cosmetics,Offline,M,10/18/2014,686800706,10/31/2014,8446,437.20,263.33,"3,692,591.20","2,224,085.18","1,468,506.02"
1,North America,Canada,Vegetables,Online,M,11/7/2011,185941302,12/8/2011,3018,154.06,90.93,"464,953.08","274,426.74","190,526.34"
2,Middle East and North Africa,Libya,Baby Food,Offline,C,10/31/2016,246222341,12/9/2016,1517,255.28,159.42,"387,259.76","241,840.14","145,419.62"
3,Asia,Japan,Cereal,Offline,C,4/10/2010,161442649,5/12/2010,3322,205.70,117.11,"683,335.40","389,039.42","294,295.98"
4,Sub-Saharan Africa,Chad,Fruits,Offline,H,8/16/2011,645713555,8/31/2011,9845,9.33,6.92,"91,853.85","68,127.40","23,726.45"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,Middle East and North Africa,Azerbaijan,Snacks,Offline,C,4/18/2010,534085166,4/25/2010,6524,152.58,97.44,"995,431.92","635,698.56","359,733.36"
996,Europe,Georgia,Baby Food,Offline,H,8/1/2011,590768182,9/7/2011,288,255.28,159.42,"73,520.64","45,912.96","27,607.68"
997,Middle East and North Africa,United Arab Emirates,Vegetables,Online,C,5/12/2011,524363124,6/28/2011,9556,154.06,90.93,"1,472,197.36","868,927.08","603,270.28"
998,Europe,Finland,Household,Offline,L,1/25/2016,289606320,2/14/2016,9801,668.27,502.54,"6,549,714.27","4,925,394.54","1,624,319.73"
999,Europe,Portugal,Cereal,Offline,C,4/10/2014,811546599,5/8/2014,3528,205.70,117.11,"725,709.60","413,164.08","312,545.52"

In [4]:
df.head()

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
0,Middle East and North Africa,Libya,Cosmetics,Offline,M,10/18/2014,686800706,10/31/2014,8446,437.20,263.33,"3,692,591.20","2,224,085.18","1,468,506.02"
1,North America,Canada,Vegetables,Online,M,11/7/2011,185941302,12/8/2011,3018,154.06,90.93,"464,953.08","274,426.74","190,526.34"
2,Middle East and North Africa,Libya,Baby Food,Offline,C,10/31/2016,246222341,12/9/2016,1517,255.28,159.42,"387,259.76","241,840.14","145,419.62"
3,Asia,Japan,Cereal,Offline,C,4/10/2010,161442649,5/12/2010,3322,205.70,117.11,"683,335.40","389,039.42","294,295.98"
4,Sub-Saharan Africa,Chad,Fruits,Offline,H,8/16/2011,645713555,8/31/2011,9845,9.33,6.92,"91,853.85","68,127.40","23,726.45"

In [5]:
df.tail()

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
995,Middle East and North Africa,Azerbaijan,Snacks,Offline,C,4/18/2010,534085166,4/25/2010,6524,152.58,97.44,"995,431.92","635,698.56","359,733.36"
996,Europe,Georgia,Baby Food,Offline,H,8/1/2011,590768182,9/7/2011,288,255.28,159.42,"73,520.64","45,912.96","27,607.68"
997,Middle East and North Africa,United Arab Emirates,Vegetables,Online,C,5/12/2011,524363124,6/28/2011,9556,154.06,90.93,"1,472,197.36","868,927.08","603,270.28"
998,Europe,Finland,Household,Offline,L,1/25/2016,289606320,2/14/2016,9801,668.27,502.54,"6,549,714.27","4,925,394.54","1,624,319.73"
999,Europe,Portugal,Cereal,Offline,C,4/10/2014,811546599,5/8/2014,3528,205.70,117.11,"725,709.60","413,164.08","312,545.52"

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 14 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Region          1000 non-null   object
 1   Country         1000 non-null   object
 2   Item Type       1000 non-null   object
 3   Sales Channel   1000 non-null   object
 4   Order Priority  1000 non-null   object
 5   Order Date      1000 non-null   object
 6   Order ID        1000 non-null   int64
 7   Ship Date       1000 non-null   object
 8   Units Sold      1000 non-null   int64
 9   Unit Price      1000 non-null   float64
 10  Unit Cost       1000 non-null   float64
 11  Total Revenue   1000 non-null   float64
 12  Total Cost      1000 non-null   float64
 13  Total Profit    1000 non-null   float64
dtypes: float64(5), int64(2), object(7)
memory usage: 109.5+ KB

In [7]:
df.isnull().sum()

Region            0
Country           0
Item Type         0
Sales Channel     0
Order Priority    0
Order Date        0
Order ID          0
Ship Date         0
Units Sold        0
Unit Price        0
Unit Cost         0
Total Revenue     0
Total Cost        0
Total Profit      0
dtype: int64

In [8]:

df3 = df.groupby(['Country']).agg('sum')

In [9]:
df3.drop(["Order ID","Unit Price","Unit Cost"],axis=1,inplace=True)

In [10]:
df3["Rev-to-Prof"] = df3["Total Profit"]/df3["Total Revenue"]
# parameter: rtp - revenue to profit introduced

In [11]:
df3.sort_values(by="Rev-to-Prof",ascending=False)

,Units Sold,Total Revenue,Total Cost,Total Profit,Rev-to-Prof
Country,,,,,
El Salvador,18350,"1,686,991.53","800,464.53","886,527.00",0.53
Montenegro,32024,"2,856,171.02","1,401,455.22","1,454,715.80",0.51
Madagascar,33923,"3,061,002.80","1,508,289.13","1,552,713.67",0.51
Mexico,11405,"1,854,866.40","923,836.64","931,029.76",0.50
Afghanistan,22651,"2,843,589.07","1,478,181.97","1,365,407.10",0.48
...,...,...,...,...,...
Tonga,38258,"11,821,702.00","9,475,616.99","2,346,085.01",0.20
Iceland,13128,"5,783,631.18","4,638,206.35","1,145,424.83",0.20
Guinea,26817,"9,896,306.25","8,033,454.57","1,862,851.68",0.19
Chad,51939,"17,278,040.69","14,330,428.01","2,947,612.68",0.17
Mauritania,23794,"6,825,381.02","5,820,818.96","1,004,562.06",0.15

In [13]:
region_df = df.groupby(["Region"]).agg('sum')

In [14]:
region_df.drop(["Order ID","Unit Cost"],axis=1,inplace=True)

In [15]:
region_df.head()

,Units Sold,Unit Price,Total Revenue,Total Cost,Total Profit
Region,,,,,
Asia,677524,"35,512.33","167,674,809.49","116,875,410.39","50,799,399.10"
Australia and Oceania,417298,"19,198.63","105,689,572.60","73,811,151.87","31,878,420.73"
Central America and the Caribbean,503362,"27,821.06","143,997,610.51","102,660,832.30","41,336,778.21"
Europe,1285808,"71,222.18","353,167,462.93","246,395,494.48","106,771,968.45"
Middle East and North Africa,682363,"34,328.12","175,106,535.74","124,049,542.40","51,056,993.34"

In [18]:
region_df["Rev-To-Prof"] = region_df["Total Profit"]/region_df["Total Revenue"]

In [20]:
region_df.sort_values(by="Rev-To-Prof",ascending=False)

,Units Sold,Unit Price,Total Revenue,Total Cost,Total Profit,Rev-To-Prof
Region,,,,,,
North America,100739,"3,893.72","24,961,598.94","17,253,539.67","7,708,059.27",0.31
Asia,677524,"35,512.33","167,674,809.49","116,875,410.39","50,799,399.10",0.30
Europe,1285808,"71,222.18","353,167,462.93","246,395,494.48","106,771,968.45",0.30
Australia and Oceania,417298,"19,198.63","105,689,572.60","73,811,151.87","31,878,420.73",0.30
Middle East and North Africa,682363,"34,328.12","175,106,535.74","124,049,542.40","51,056,993.34",0.29
Central America and the Caribbean,503362,"27,821.06","143,997,610.51","102,660,832.30","41,336,778.21",0.29
Sub-Saharan Africa,1386894,"70,130.80","356,724,250.12","255,073,257.66","101,650,992.46",0.28

In [22]:
maxP = df3[df3["Total Profit"] == df3["Total Profit"].max()]

In [23]:
maxP

         Units Sold  Total Revenue    Total Cost  Total Profit  Rev-to-Prof
Country
Cuba          73479  27,522,085.87 20,170,265.04  7,351,820.83         0.27

## cuba gives the max profit

# Revenue-to-Profit 
- tells how much profit per 1 unit of sale is generated
### Examples
- 20 revenue and profit 8
#### RTP is 8/20 = 0.4
- 20 revenue and profit 14
#### RTP is 14/20 = 0.7


# the higher, the better

# a measure of effectiveness of sales